import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';

@Component({
  selector: 'app-faq',
  standalone: true,
  imports: [CommonModule],
  templateUrl: './faq.component.html',
  styleUrl: './faq.component.css'
})
export class FaqComponent {
  faqs = [
    {
      heading: 'განაცხადი წყალმომარაგების სისტემაზე ერთი ახალი მომხმარებლის მიერთების მოთხოვნის შესახებ - თბილისი',
      content: '- განმცხადებლის პირადობიმოწმობის ასლი ამონაწერი სამეწარმეო რეესტრიდან (იურიდიული პირის შემთხვევაში) ამონაწერი საჯარო რეესტრიდან ან ნებისმიერი დოკუმენტი, რომელიც წარმოადგენს საკუთრების უფლების რეგისტრაციის საფუძველს - მიერთების საფასურის 50%-ის გადახდის დამადასტურებელი საბუთი, ხოლო, თუ ადგილი აქვს, წყალმომარაგების სისტემაზე მრავალბინიანი საცხოვრებელი სახლის მიერთებას - მიერთების საფასურის 100%-ის გადახდის დამადასტურებელი დოკუმენტი',
      expanded: false
    },
    {
      heading: 'განაცხადი წყალმომარაგების სისტემაზე ერთი ახალი მომხმარებლის მიერთების მოთხოვნის შესახებ - თბილისი',
      content: '- განმცხადებლის პირადობიმოწმობის ასლი ამონაწერი სამეწარმეო რეესტრიდან (იურიდიული პირის შემთხვევაში) ამონაწერი საჯარო რეესტრიდან ან ნებისმიერი დოკუმენტი, რომელიც წარმოადგენს საკუთრების უფლების რეგისტრაციის საფუძველს - მიერთების საფასურის 50%-ის გადახდის დამადასტურებელი საბუთი, ხოლო, თუ ადგილი აქვს, წყალმომარაგების სისტემაზე მრავალბინიანი საცხოვრებელი სახლის მიერთებას - მიერთების საფასურის 100%-ის გადახდის დამადასტურებელი დოკუმენტი',
      expanded: false
    },
    {
      heading: 'განაცხადი წყალმომარაგების სისტემაზე ერთი ახალი მომხმარებლის მიერთების მოთხოვნის შესახებ - თბილისი',
      content: '- განმცხადებლის პირადობიმოწმობის ასლი ამონაწერი სამეწარმეო რეესტრიდან (იურიდიული პირის შემთხვევაში) ამონაწერი საჯარო რეესტრიდან ან ნებისმიერი დოკუმენტი, რომელიც წარმოადგენს საკუთრების უფლების რეგისტრაციის საფუძველს - მიერთების საფასურის 50%-ის გადახდის დამადასტურებელი საბუთი, ხოლო, თუ ადგილი აქვს, წყალმომარაგების სისტემაზე მრავალბინიანი საცხოვრებელი სახლის მიერთებას - მიერთების საფასურის 100%-ის გადახდის დამადასტურებელი დოკუმენტი',
      expanded: false
    },
    {
      heading: 'განაცხადი წყალმომარაგების სისტემაზე ერთი ახალი მომხმარებლის მიერთების მოთხოვნის შესახებ - თბილისი',
      content: '- განმცხადებლის პირადობიმოწმობის ასლი ამონაწერი სამეწარმეო რეესტრიდან (იურიდიული პირის შემთხვევაში) ამონაწერი საჯარო რეესტრიდან ან ნებისმიერი დოკუმენტი, რომელიც წარმოადგენს საკუთრების უფლების რეგისტრაციის საფუძველს - მიერთების საფასურის 50%-ის გადახდის დამადასტურებელი საბუთი, ხოლო, თუ ადგილი აქვს, წყალმომარაგების სისტემაზე მრავალბინიანი საცხოვრებელი სახლის მიერთებას - მიერთების საფასურის 100%-ის გადახდის დამადასტურებელი დოკუმენტი',
      expanded: false
    }
  ];

  toggleFAQ(faq: any) {
    faq.expanded = !faq.expanded;
  }
}
